In [1]:
import pandas as pd

In [2]:
data1 = pd.read_csv("List1.csv")
data2 = pd.read_csv("List2.csv")

In [4]:
data1.rename(columns={
    "INSTNM":"inst",
    "CITY":"city",
    "STABBR":"state"
}, inplace=True)

data2.rename(columns={
    "Institution Name":"inst",
    "State":"state"
}, inplace=True)

In [5]:
data1.head()

       ID                                 inst        city state
0  100654             Alabama A & M University      Normal    AL
1  100663  University of Alabama at Birmingham  Birmingham    AL
2  100690                   Amridge University  Montgomery    AL
3  100706  University of Alabama in Huntsville  Huntsville    AL
4  100724             Alabama State University  Montgomery    AL

In [6]:
data2.head()

                           inst state
0        Aaniiih Nakoda College    MT
1  Abilene Christian University    TX
2    Abraham Lincoln University    CA
3               Academy College    MN
4     Academy of Art University    CA

In [7]:
data1["inst"] = data1["inst"].map(lambda univ:univ.lower())
data2["inst"] = data2["inst"].map(lambda univ:univ.lower())

In [8]:
data1.head()

       ID                                 inst        city state
0  100654             alabama a & m university      Normal    AL
1  100663  university of alabama at birmingham  Birmingham    AL
2  100690                   amridge university  Montgomery    AL
3  100706  university of alabama in huntsville  Huntsville    AL
4  100724             alabama state university  Montgomery    AL

In [9]:
data2.head()

                           inst state
0        aaniiih nakoda college    MT
1  abilene christian university    TX
2    abraham lincoln university    CA
3               academy college    MN
4     academy of art university    CA

In [25]:
data1_cpy = data1[["inst", "state", "city"]]
data1_cpy.head()

                                  inst state        city
0             alabama a & m university    AL      Normal
1  university of alabama at birmingham    AL  Birmingham
2                   amridge university    AL  Montgomery
3  university of alabama in huntsville    AL  Huntsville
4             alabama state university    AL  Montgomery

In [26]:
data_merged = pd.merge(data1_cpy, data2, on=["inst","state"])

In [27]:
data_merged.head(10)

                                  inst state        city
0             alabama a & m university    AL      Normal
1  university of alabama at birmingham    AL  Birmingham
2  university of alabama in huntsville    AL  Huntsville
3             alabama state university    AL  Montgomery
4            the university of alabama    AL  Tuscaloosa
5                    auburn university    AL      Auburn
6          south university-montgomery    AL  Montgomery
7        herzing university-birmingham    AL  Birmingham
8                   huntingdon college    AL  Montgomery
9        heritage christian university    AL    Florence

In [28]:
data_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1972 entries, 0 to 1971
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   inst    1972 non-null   object
 1   state   1972 non-null   object
 2   city    1972 non-null   object
dtypes: object(3)
memory usage: 46.3+ KB

In [29]:
data_merged.duplicated().sum()

2

In [30]:
concated_data = pd.concat([data1_cpy, data2], ignore_index=True)

In [31]:
concated_data.head()

                                  inst state        city
0             alabama a & m university    AL      Normal
1  university of alabama at birmingham    AL  Birmingham
2                   amridge university    AL  Montgomery
3  university of alabama in huntsville    AL  Huntsville
4             alabama state university    AL  Montgomery

In [32]:
concated_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8524 entries, 0 to 8523
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   inst    8524 non-null   object
 1   state   8524 non-null   object
 2   city    6484 non-null   object
dtypes: object(3)
memory usage: 199.9+ KB

In [33]:
concated_data.duplicated().sum()

13

In [34]:
concated_data = concated_data.drop_duplicates()
concated_data.duplicated().sum()

0

In [35]:
concated_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8511 entries, 0 to 8523
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   inst    8511 non-null   object
 1   state   8511 non-null   object
 2   city    6472 non-null   object
dtypes: object(3)
memory usage: 266.0+ KB

In [36]:
concated_data.to_csv("cleaned_data_with_cities.csv", index=False)